namespace WinFormsApp2
{
    public static class QuizData
    {
        // index: 0..6 (ตอนนี้มี 7 ข้อ)
        public static readonly (string Question, string A, string B)[] Questions = new[]
        {
            (
                "1. ถ้าวันนี้ว่างหนึ่งวัน คุณอยากทำอะไร?",
                "A) นัดเพื่อน ออกไปทำกิจกรรมข้างนอก",
                "B) อยู่บ้านไม่ออกไปข้างนอก"
            ),
            (
                "2. ตอนมีเรื่องดีใจ คุณอยาก…",
                "A) รีบไปเล่าให้คนอื่นฟัง",
                "B) เก็บไว้ในใจคนเดียว"
            ),
            (
                "3. เวลาเครียด คุณจะทำอย่างไร?",
                "A) คุยกับเพื่อนสนิท เพื่อขอคำแนะนำ",
                "B) อยู่เงียบๆคนเดียว และจัดการความคิดตัวเอง"
            ),
            (
                "4. เวลาอยู่ในงานสังสรรค์",
                "A) เข้าหาหรือคุยกับคนอื่นก่อน \nเอ็นจอยกับบรรยากาศ",
                "B) อยู่มุมเงียบๆ คุยแค่กับคนสนิท"
            ),
            (
                "5. เวลาเพื่อนชวนออกไปข้างนอก",
                "A) ไปแน่ๆ",
                "B) ขอคิดดูก่อน"
            ),
            (
                "6. คุณชอบเริ่มบทสนทนาไหม",
                "A) ชอบ",
                "B) ไม่ค่อยชอบ"
            ),
            (
                "7. เวลาทำงานหรือสอบเสร็จ",
                "A) นัดกินข้าวกับเพื่อน หรือไปเที่ยว",
                "B) กลับบ้านพักผ่อน"
            ),
        };
    }
}
